DeviceTvmSoftwareInventory
| where SoftwareName has "wordpress"
| where SoftwareVersion in ("6.9.0", "6.9.1", "6.9.2", "6.9.3", "6.9.4", "7.0.0", "7.0.1")
| project TimeGenerated, DeviceId, DeviceName, SoftwareName, SoftwareVersion
